app/Models/ModelKategori.php

SELECT *
FROM `tbl_kategori`
---
    public function AllData()
    {
        return $this->db->table('tbl_kategori')
        ->get()->getResultArray();

UPDATE `tbl_kategori` SET `id_kategori` = '3', `nama_kategori` = NULL, `marker` = '1777456806_64b9e20742e441262ad3.png'
WHERE `id_kategori` = '3'
---
    public function UpdateData($data)
    {
        $this->db->table('tbl_kategori')
        ->where('id_kategori', $data['id_kategori'])
        ->update($data);