app/Models/ModelSetting.php

   public function DataWeb()
    {
        return $this->db->table('tbl_setting')
        ->where('id', 1) // ← DIUBAH DI SINI
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id` = 1

    public function UpdateData($data)
    {
        $this->db->table('tbl_setting')
        ->where('id', 1) // ← DIUBAH DI SINI
        ->update($data);
---
UPDATE `tbl_setting` SET `id` = 1, `nama_web` = 'WEB GIS LOKASI KOST', `koordinat_wilayah` = '-7.234900335145906, 108.91239771333454', `zoom_view` = '11'
WHERE `id` = 1