app/Models/ModelKost.php

    public function AllData()
    {
        return $this->db->table('tbl_kost')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_kost`